Revit 2020 API
UnitUtils Methods
The UnitUtils type exposes the following members.
Methods
Name | Description
Convert
 Converts a value from one display unit to another, such as square feet to square meters.
ConvertFromInternalUnits
 Converts a value from Revit's internal units to a given display unit.
ConvertToInternalUnits
 Converts a value from a given display unit to Revit's internal units.
GetTypeCatalogString(DisplayUnitType)
 Gets the string used in type catalogs to identify a given display unit.
GetTypeCatalogString(UnitType)
 Gets the string used in type catalogs to identify a given unit type.
GetUnitGroup
 Gets the unit group for a given unit type.
GetValidDisplayUnits()
 Gets all valid display units.
GetValidDisplayUnits(UnitType)
 Gets all valid display units for a given unit type.
GetValidUnitTypes
 Gets all valid unit types.
IsValidDisplayUnit(DisplayUnitType)
 Checks whether a display unit is valid.
IsValidDisplayUnit(UnitType, DisplayUnitType)
 Checks whether a display unit is valid for a given unit type.
IsValidUnitType
 Checks whether a unit type is valid.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace